src/main/resources/wsdl/Test_wsdl/MFUploadService.xml

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions name="MFUploadService"
	targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
	xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:i0="http://bsestarmfdemo.bseindia.com/2016/01/"
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
	xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy"
	xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy"
	xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract"
	xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
	xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:tns="http://tempuri.org/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
	xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
	<wsp:Policy wsu:Id="WSHttpBinding_IMFUploadService_policy">
		<wsp:ExactlyOne>
			<wsp:All>
				<wsaw:UsingAddressing />
			</wsp:All>
		</wsp:ExactlyOne>
	</wsp:Policy>
	<wsp:Policy wsu:Id="WSHttpBinding_IMFUploadService1_policy">
		<wsp:ExactlyOne>
			<wsp:All>
				<sp:TransportBinding
					xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
					<wsp:Policy>
						<sp:TransportToken>
							<wsp:Policy>
								<sp:HttpsToken RequireClientCertificate="false" />
							</wsp:Policy>
						</sp:TransportToken>
						<sp:AlgorithmSuite>
							<wsp:Policy>
								<sp:Basic256 />
							</wsp:Policy>
						</sp:AlgorithmSuite>
						<sp:Layout>
							<wsp:Policy>
								<sp:Strict />
							</wsp:Policy>
						</sp:Layout>
					</wsp:Policy>
				</sp:TransportBinding>
				<wsaw:UsingAddressing />
			</wsp:All>
		</wsp:ExactlyOne>
	</wsp:Policy>
	<wsdl:import namespace="http://bsestarmfdemo.bseindia.com/2016/01/"
		location="http://bsestarmfdemo.bseindia.com/MFUploadService/MFUploadService.svc?wsdl=wsdl0" />
	<wsdl:types />
	<wsdl:binding name="WSHttpBinding_IMFUploadService" type="i0:IMFUploadService">
		<wsp:PolicyReference URI="#WSHttpBinding_IMFUploadService_policy" />
		<soap12:binding transport="http://schemas.xmlsoap.org/soap/http" />
		<wsdl:operation name="getPassword">
			<soap12:operation
				soapAction="http://bsestarmfdemo.bseindia.com/2016/01/IMFUploadService/getPassword"
				style="document" />
			<wsdl:input>
				<soap12:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap12:body use="literal" />
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="MFAPI">
			<soap12:operation
				soapAction="http://bsestarmfdemo.bseindia.com/2016/01/IMFUploadService/MFAPI"
				style="document" />
			<wsdl:input>
				<soap12:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap12:body use="literal" />
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:binding name="WSHttpBinding_IMFUploadService1" type="i0:IMFUploadService">
		<wsp:PolicyReference URI="#WSHttpBinding_IMFUploadService1_policy" />
		<soap12:binding transport="http://schemas.xmlsoap.org/soap/http" />
		<wsdl:operation name="getPassword">
			<soap12:operation
				soapAction="http://bsestarmfdemo.bseindia.com/2016/01/IMFUploadService/getPassword"
				style="document" />
			<wsdl:input>
				<soap12:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap12:body use="literal" />
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="MFAPI">
			<soap12:operation
				soapAction="http://bsestarmfdemo.bseindia.com/2016/01/IMFUploadService/MFAPI"
				style="document" />
			<wsdl:input>
				<soap12:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap12:body use="literal" />
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="MFUploadService">
		<wsdl:port name="WSHttpBinding_IMFUploadService" binding="tns:WSHttpBinding_IMFUploadService">
			<soap12:address
				location="http://bsestarmfdemo.bseindia.com/MFUploadService/MFUploadService.svc/Basic" />
			<wsa10:EndpointReference>
				<wsa10:Address>http://bsestarmfdemo.bseindia.com/MFUploadService/MFUploadService.svc/Basic</wsa10:Address>
			</wsa10:EndpointReference>
		</wsdl:port>
		<wsdl:port name="WSHttpBinding_IMFUploadService1" binding="tns:WSHttpBinding_IMFUploadService1">
			<soap12:address
				location="https://bsestarmfdemo.bseindia.com/MFUploadService/MFUploadService.svc/Secure" />
			<wsa10:EndpointReference>
				<wsa10:Address>https://bsestarmfdemo.bseindia.com/MFUploadService/MFUploadService.svc/Secure</wsa10:Address>
			</wsa10:EndpointReference>
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>